configuration/src/InformationRegisters/СрокиСдачиЗадач/СрокиСдачиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СрокиСдачиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СрокСдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СрокиСдачиЗадач/Forms/ИзменениеСрокаСдачи/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Задача") И Параметры.Свойство("НовыйСрокСдачи") И Параметры.Свойство("СтарыйСрокСдачи") Тогда	
		Задача = Параметры.Задача;
		ДатаКалендаря = Параметры.НовыйСрокСдачи;
		ПредыдущийСрокСдачи = Параметры.СтарыйСрокСдачи;
		
		// Заполнение заголовков
		СтарыйСрокСдачи = Формат(Параметры.СтарыйСрокСдачи, "ДФ='dd.MM.yyyy'");
		НовыйСрокСдачи = Формат(Параметры.НовыйСрокСдачи, "ДФ='dd.MM.yyyy'");
	Иначе
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Форма не предназначена для непосредственного открытия.";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаКалендаряПриИзменении(Элемент)
		
	НовыйСрокСдачи = Формат(ДатаКалендаря, "ДФ='dd.MM.yyyy'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
		ПоказатьПредупреждение(, "Не заполнен комментарий.",,);
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ОбщегоНазначенияКлиент.ПроверитьКорректностьНовогоСрока(ДатаКалендаря, ПредыдущийСрокСдачи);

	Если РезультатПроверки.Ошибка Тогда
		ПоказатьПредупреждение(, РезультатПроверки.ТекстОшибки,,);
	Иначе
		ПараметрыЗакрытия = Новый Структура("СрокСдачи, Комментарий", ДатаКалендаря, Комментарий);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
